//////////////////////////////////////////////////////////////////////////////////////////////////////
// Создайте функцию readNumber, которая будет запрашивать ввод числового значения до тех пор, пока посетитель его не введёт.
//
// Функция должна возвращать числовое значение.
//
// Также надо разрешить пользователю остановить процесс ввода, отправив пустую строку или нажав «Отмена». В этом случае функция должна вернуть null.

/////////////////////////////////////////////////////////////////////////////////////////////////////////
// ver 1

'use strict'

function readNumber() {

    let numberWrite = prompt('Введите числовое значение', '');

    if (numberWrite === '' || numberWrite === null) {
        return null;
    }

    if (isFinite(numberWrite)) {
        return Number(numberWrite);
    } else {
        readNumber();
    }

};

readNumber();
