//////////////////////////////////////////////////////////////////////////////////////////////////
// Следующая функция возвращает true, если параметр age больше 18.
//
// В ином случае она задаёт вопрос confirm и возвращает его результат.
//
// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm('Родители разрешили?');
//   }
// }
// Перепишите функцию, чтобы она делала то же самое, но без if, в одну строку.
//
// Сделайте два варианта функции checkAge:
//
// Используя оператор ?
// Используя оператор ||

//////////////////////////////////////////////////////////////////////////////////////////////////
// Используя оператор ?

/* let age = prompt("Введите Ваш возраст", '');

function checkAge(age) {
    return (age >= 18) ? true : confirm('Родители разрешили?');
}

alert(checkAge(age)); */

//////////////////////////////////////////////////////////////////////////////////////////////////
// Используя оператор ||

/* let age = prompt("Введите Ваш возраст", '');

function checkAge(age) { 
    return (age >= 18) || confirm('Родители разрешили?');
}

alert(checkAge(age)); */

//////////////////////////////////////////////////////////////////////////////////////////////////
// Напишите функцию min(a,b), которая возвращает меньшее из чисел a и b.
//
// Пример вызовов:
//
// min(2, 5) == 2
// min(3, -1) == -1
// min(1, 1) == 1

/* let a = +prompt('Введите первое число', '');
let b = +prompt('Введите второе число', '');

function getMinNumber(a, b) {
    return (a > b) ? a : b;
}

alert(getMinNumber(a, b)); */

//////////////////////////////////////////////////////////////////////////////////////////////////
// Напишите функцию pow(x,n), которая возвращает x в степени n. Иначе говоря, умножает x на себя n раз и возвращает результат.
//
// pow(3, 2) = 3 * 3 = 9
// pow(3, 3) = 3 * 3 * 3 = 27
// pow(1, 100) = 1 * 1 * ...* 1 = 1
// Создайте страницу, которая запрашивает x и n, а затем выводит результат pow(x,n).
//
// Запустить демо
//
// P.S. В этой задаче функция обязана поддерживать только натуральные значения n, т.е. целые от 1 и выше.

let a = +prompt('Введите первое число', '');
let b = +prompt('Введите второе число', '');

function getPow(a, b) {

    if (a >= 1 && b >= 1) {

        let result = a;

        for (let i = 1; i < b; i++) {
            result *= a;
        }

        return result;

    } else {
        alert('Press F5');
    }
}

alert(getPow(a, b));

//////////////////////////////////////////////////////////////////////////////////////////////////